{"text": "Me gustó mucho la forma en que la profesora explicó los temas, fue muy didáctica y siempre dispuesta a ayudar. Su entusiasmo y pasión por el tema se transmitieron a los estudiantes y nos motivaron a aprender. La profesora tiene una gran capacidad para hacer que el aprendizaje sea divertido y atractivo.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso fue una excelente experiencia, me permitió aprender y crecer en mi área de interés. La estructura del curso y la forma en que se presentaron los temas fueron muy claros y fáciles de seguir. Me gustó la variedad de actividades y recursos disponibles para apoyar el aprendizaje.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La profesora fue común, siempre dispuesta a ayudar y con una actitud moderada. La forma en que explicó los temas fue suficiente para entenderlos, pero no fue nada especial. Fue un curso pasable, nada más.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El curso fue regular, me permitió aprender algunos conceptos básicos en mi área de interés. La estructura del curso era estándar y la forma en que se presentaron los temas fue suficiente para entenderlos. No fue un curso emocionante, pero fue aceptable.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La profesora fue increíble, siempre dispuesta a ayudar y con una actitud brillante. La forma en que explicó los temas fue genial, me hizo sentir emocionado y motivado para aprender. Fue un curso perfecto, no podría haber sido mejor.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Fue un curso genial, me permitió aprender y crecer en mi área de interés de forma eficiente y emocionante. La estructura del curso y la forma en que se presentaron los temas fueron claros y fáciles de seguir. Me gustó la variedad de actividades y recursos disponibles para apoyar el aprendizaje.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Mi profesora ha sido ordinaria y ha cumplido con su papel de manera suficiente. Su dedicación y pasión por el trabajo son comunes en muchos profesores, pero no han sido brillantes. Me he sentido tolerable con la forma en que se ha cuidado de nosotros y me ha proporcionado retroalimentación moderada.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso ha sido regular y ha cumplido con mis expectativas. Me he sentido satisfecho con la forma en que se ha estructurado el curso, aunque no ha sido espectacular. La variedad de actividades y recursos ha sido aceptable, pero no ha sido asombroso.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La profesora Ana María es excelente, su explicación es clara y aprendí mucho. Es genial y fantástico tenerla como docente.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El curso de Ingeniería de Software II es excelente y bueno, aprendí conceptos claros y útiles. Es genial y fantástico.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Ana María es una profesora maravillosa, su guía es útil y siempre tiene una actitud positiva y agradable en clase.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que el curso es maravilloso y útil, tiene un enfoque positivo y agradable para el aprendizaje.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Me siento satisfecho con la profesora Ana María, su enseñanza es perfecta y estoy feliz y contento con su dedicación.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Estoy satisfecho con el curso de Ingeniería de Software II, es perfecto y me siento feliz y contento con el contenido.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Ana María es increíblemente eficiente, su apoyo es asombroso y siempre tiene una actitud brillante en Ingeniería de Software II.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El curso es increíblemente eficiente y asombroso, la organización es brillante y es una maravilla.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Es una maravilla la forma en que Ana María enseña, es espectacular y siempre hace la clase emocionante y grandiosa.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La dinámica del curso es espectacular y emocionante, el aprendizaje es grandioso e inspirador.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Ana María es una profesora inspiradora, su motivación es constructiva y su retroalimentación siempre es enriquecedora y oportuna.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que el curso es motivador y constructivo, la experiencia es enriquecedora y oportuna para mi formación.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que Ana María es acertada en su enseñanza, valiosa para nuestro aprendizaje y provechosa en cada clase de Ingeniería de Software II.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El contenido del curso es acertado y valioso, el aprendizaje es provechoso e interesante para mi carrera.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La profesora Ana María hace la clase interesante y dinámica, siempre participativa y con un curso bien estructurado.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La metodología del curso es dinámica y participativa, el curso está organizado y bien estructurado.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La profesora Ana María es normal, su desempeño es neutral y regular durante las clases de Ingeniería de Software II.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso de Ingeniería de Software II es normal y neutral, el contenido es regular y promedio para la materia.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que Ana María tiene un estilo de enseñanza promedio, es aceptable y suficiente para el desarrollo del curso.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el curso es suave y aceptable, el nivel es suficiente y se mantiene en un estándar común.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Mi experiencia con la profesora Ana María ha sido suave, su trato es estándar y la comunicación es común.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Mi experiencia con el curso de Ingeniería de Software II ha sido ordinaria y pasable, dentro de lo moderado y tolerable", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La forma en que Ana María lleva el curso de Ingeniería de Software II es ordinaria, dentro de lo pasable y moderado", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso presenta un contenido simple y sencillo, algo habitual y corriente dentro de la ingeniería.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Diría que la actitud de Ana María es tolerable, su nivel de compromiso es suficiente y se mantiene en un estándar.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La estructura del curso es típica y característica, el desarrollo es usual y frecuente.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La explicación de Ana María en Ingeniería de Software II es simple, sin destacar pero tampoco siendo negativa, algo habitual.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el nivel del curso es general y medio, sin elementos particularmente positivos o negativos.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que la retroalimentación de Ana María es corriente, cumple con lo típico y se mantiene en un nivel promedio.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El enfoque del curso es intermedio y equilibrado, manteniendo un balance y resultando objetivo.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La gestión del curso por parte de Ana María es equilibrada, se mantiene en un punto medio y resulta aceptable para la mayoría.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La organización del curso es balanceada y moderada, resultando aceptable y dentro de lo estándar.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La profesora Ana María es mala explicando, su clase es confusa y mi aprendizaje ha sido pésimo en Ingeniería de Software II.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El curso de Ingeniería de Software II es malo y confuso, mi aprendizaje ha sido pésimo y no he aprendido nada.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que la dedicación de Ana María es nada positiva, su actitud es horrible y mi experiencia ha sido terrible.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que el curso es horrible y terrible, la experiencia es desagradable e inútil para mi formación.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que la enseñanza de Ana María es desagradable e inútil, su retroalimentación es negativa y frustrante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, el curso es negativo y frustrante, mi experiencia ha sido decepcionante y lenta.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, Ana María es decepcionante como profesora, su ritmo es lento e ineficiente en Ingeniería de Software II.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El curso de Ingeniería de Software II es ineficiente y aburrido, además de difícil y problemático.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La clase de Ana María es aburrida y difícil, siento que el curso es problemático y desastroso.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que el curso es desastroso y horrendo, mi experiencia ha sido insatisfactoria e irritante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Mi experiencia con Ana María ha sido horrenda e insatisfactoria, su actitud es irritante y molesta en clase", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el curso es molesto y paupérrimo, el contenido es nefasto y lamentable para mi aprendizaje.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que Ana María es paupérrima enseñando, su método es nefasto y mi aprendizaje ha sido lamentable.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La estructura del curso es deplorable y funesta, siento que no he obtenido nada positivo y ha sido nocivo.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La forma en que Ana María lleva el curso es deplorable, siento que es funesto y no he aprendido nada positivo.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El desarrollo del curso ha sido perjudicial y dañino, la experiencia ha sido tóxica y repugnante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Fercho explica Probabilidad y Estadística de manera excelente, su claridad hace que aprenda mucho. Es genial y fantástico tenerlo como docente.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El curso de Probabilidad y Estadística es excelente y bueno, aprendí conceptos claros y útiles. Es genial y fantástico.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Fercho es un profesor maravilloso, su guía es útil y siempre tiene una actitud positiva y agradable en clase de Probabilidad y Estadística.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que el curso es maravilloso y útil, tiene un enfoque positivo y agradable para el aprendizaje.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Me siento satisfecho con Fercho, su enseñanza es perfecta y estoy feliz y contento con su dedicación al curso.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Estoy satisfecho con el curso de Probabilidad y Estadística, es perfecto y me siento feliz y contento con el contenido.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Fercho es increíblemente eficiente, su apoyo es asombroso y siempre tiene una actitud brillante en Probabilidad y Estadística.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El curso es increíblemente eficiente y asombroso, la organización es brillante y es una maravilla.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Es una maravilla la forma en que Fercho enseña, es espectacular y siempre hace la clase emocionante y grandiosa.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La dinámica del curso es espectacular y emocionante, el aprendizaje es grandioso e inspirador.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Fercho es un profesor inspirador, su motivación es constructiva y su retroalimentación siempre es enriquecedora y oportuna.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que el curso es motivador y constructivo, la experiencia es enriquecedora y oportuna para mi formación.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que Fercho es acertado en su enseñanza, valioso para nuestro aprendizaje y provechoso en cada clase de Probabilidad y Estadística.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El contenido del curso es acertado y valioso, el aprendizaje es provechoso e interesante para mi carrera.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Fercho hace la clase interesante y dinámica, siempre participativa y con un curso bien estructurado.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La metodología del curso es dinámica y participativa, el curso está organizado y bien estructurado.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El profesor Fernando Concha es normal, su desempeño es neutral y regular durante las clases de Probabilidad y Estadística.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso de Probabilidad y Estadística es normal y neutral, el contenido es regular y promedio para la materia.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que Fernando Concha tiene un estilo de enseñanza promedio, es aceptable y suficiente para el desarrollo del curso.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el curso es suave y aceptable, el nivel es suficiente y se mantiene en un estándar común.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Mi experiencia con el profesor Fernando Concha ha sido suave, su trato es estándar y la comunicación es común.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Mi experiencia con el curso de Probabilidad y Estadística ha sido ordinaria y pasable, dentro de lo moderado y tolerable.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La forma en que Fernando Concha lleva el curso de Probabilidad y Estadística es ordinaria, dentro de lo pasable y moderado.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso presenta un contenido simple y sencillo, algo habitual y corriente dentro de la ingeniería.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Diría que la actitud de Fernando Concha es tolerable, su nivel de compromiso es suficiente y se mantiene en un estándar.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La estructura del curso es típica y característica, el desarrollo es usual y frecuente.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La explicación de Fernando Concha en Probabilidad y Estadística es simple, sin destacar pero tampoco siendo negativa, algo habitual.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el nivel del curso es general y medio, sin elementos particularmente positivos o negativos.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que la retroalimentación de Fernando Concha es corriente, cumple con lo típico y se mantiene en un nivel promedio.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El enfoque del curso es intermedio y equilibrado, manteniendo un balance y resultando objetivo.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La gestión del curso por parte de Fernando Concha es equilibrada, se mantiene en un punto medio y resulta aceptable para la mayoría.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La organización del curso es balanceada y moderada, resultando aceptable y dentro de lo estándar.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El profesor Fernando Concha es malo explicando, su clase es confusa y mi aprendizaje ha sido pésimo en Probabilidad y Estadística.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El curso de Probabilidad y Estadística es malo y confuso, mi aprendizaje ha sido pésimo y no he aprendido nada.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que la dedicación de Fernando Concha es nada positiva, su actitud es horrible y mi experiencia ha sido terrible.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que el curso es horrible y terrible, la experiencia es desagradable e inútil para mi formación.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que la enseñanza de Fernando Concha es desagradable e inútil, su retroalimentación es negativa y frustrante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, el curso es negativo y frustrante, mi experiencia ha sido decepcionante y lenta.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, Fernando Concha es decepcionante como profesor, su ritmo es lento e ineficiente en Probabilidad y Estadística.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, el curso es negativo y frustrante, mi experiencia ha sido decepcionante y lenta.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La clase de Fernando Concha es aburrida y difícil, siento que el curso es problemático y desastroso.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que el curso es desastroso y horrendo, mi experiencia ha sido insatisfactoria e irritante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La clase de Fernando Concha es aburrida y difícil, siento que el curso es problemático y desastroso.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que el curso es desastroso y horrendo, mi experiencia ha sido insatisfactoria e irritante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Mi experiencia con Fernando Concha ha sido horrenda e insatisfactoria, su actitud es irritante y molesta en clase.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el curso es molesto y paupérrimo, el contenido es nefasto y lamentable para mi aprendizaje.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que Fernando Concha es paupérrimo enseñando, su método es nefasto y mi aprendizaje ha sido lamentable.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La estructura del curso es deplorable y funesta, siento que no he obtenido nada positivo y ha sido nocivo.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La forma en que Fernando Concha lleva el curso es deplorable, siento que es funesto y no he aprendido nada positivo.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El desarrollo del curso ha sido perjudicial y dañino, la experiencia ha sido tóxica y repugnante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Ana Gabriela explica Base de Datos II de manera excelente, su claridad hace que aprenda mucho. Es genial y fantástico tenerla como docente.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El curso de Base de Datos II es excelente y bueno, aprendí conceptos claros y útiles. Es genial y fantástico.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Ana Gabriela es una profesora maravillosa, su guía es útil y siempre tiene una actitud positiva y agradable en clase de Base de Datos II.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que el curso es maravilloso y útil, tiene un enfoque positivo y agradable para el aprendizaje.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Me siento satisfecho con Ana Gabriela, su enseñanza es perfecta y estoy feliz y contento con su dedicación al curso.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Estoy satisfecho con el curso de Base de Datos II, es perfecto y me siento feliz y contento con el contenido.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Ana Gabriela es increíblemente eficiente, su apoyo es asombroso y siempre tiene una actitud brillante en Base de Datos II.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El curso es increíblemente eficiente y asombroso, la organización es brillante y es una maravilla.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Es una maravilla la forma en que Ana Gabriela enseña, es espectacular y siempre hace la clase emocionante y grandiosa.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La dinámica del curso es espectacular y emocionante, el aprendizaje es grandioso e inspirador.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Ana Gabriela es una profesora inspiradora, su motivación es constructiva y su retroalimentación siempre es enriquecedora y oportuna.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que el curso es motivador y constructivo, la experiencia es enriquecedora y oportuna para mi formación.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que Ana Gabriela es acertada en su enseñanza, valiosa para nuestro aprendizaje y provechosa en cada clase de Base de Datos II.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El contenido del curso es acertado y valioso, el aprendizaje es provechoso e interesante para mi carrera.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Ana Gabriela hace la clase interesante y dinámica, siempre participativa y con un curso bien estructurado.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La metodología del curso es dinámica y participativa, el curso está organizado y bien estructurado.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La profesora Ana Gabriela es normal, su desempeño es neutral y regular durante las clases de Base de Datos II.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso de Base de Datos II es normal y neutral, el contenido es regular y promedio para la materia.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que Ana Gabriela tiene un estilo de enseñanza promedio, es aceptable y suficiente para el desarrollo del curso.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el curso es suave y aceptable, el nivel es suficiente y se mantiene en un estándar común.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Mi experiencia con la profesora Ana Gabriela ha sido suave, su trato es estándar y la comunicación es común.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Mi experiencia con el curso de Base de Datos II ha sido ordinaria y pasable, dentro de lo moderado y tolerable.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La forma en que Ana Gabriela lleva el curso de Base de Datos II es ordinaria, dentro de lo pasable y moderado.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso presenta un contenido simple y sencillo, algo habitual y corriente dentro de la ingeniería.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Diría que la actitud de Ana Gabriela es tolerable, su nivel de compromiso es suficiente y se mantiene en un estándar.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La estructura del curso es típica y característica, el desarrollo es usual y frecuente.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La explicación de Ana Gabriela en Base de Datos II es simple, sin destacar pero tampoco siendo negativa, algo habitual.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el nivel del curso es general y medio, sin elementos particularmente positivos o negativos.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que la retroalimentación de Ana Gabriela es corriente, cumple con lo típico y se mantiene en un nivel promedio.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El enfoque del curso es intermedio y equilibrado, manteniendo un balance y resultando objetivo.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La gestión del curso por parte de Ana Gabriela es equilibrada, se mantiene en un punto medio y resulta aceptable para la mayoría.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La organización del curso es balanceada y moderada, resultando aceptable y dentro de lo estándar.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La profesora Ana Gabriela es mala explicando, su clase es confusa y mi aprendizaje ha sido pésimo en Base de Datos II.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El curso de Base de Datos II es malo y confuso, mi aprendizaje ha sido pésimo y no he aprendido nada.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que la dedicación de Ana Gabriela es nada positiva, su actitud es horrible y mi experiencia ha sido terrible.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que el curso es horrible y terrible, la experiencia es desagradable e inútil para mi formación.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que la enseñanza de Ana Gabriela es desagradable e inútil, su retroalimentación es negativa y frustrante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, el curso es negativo y frustrante, mi experiencia ha sido decepcionante y lenta.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, Ana Gabriela es decepcionante como profesora, su ritmo es lento e ineficiente en Base de Datos II.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El curso de Base de Datos II es ineficiente y aburrido, además de difícil y problemático.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La clase de Ana Gabriela es aburrida y difícil, siento que el curso es problemático y desastroso.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que el curso es desastroso y horrendo, mi experiencia ha sido insatisfactoria e irritante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Mi experiencia con Ana Gabriela ha sido horrenda e insatisfactoria, su actitud es irritante y molesta en clase.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el curso es molesto y paupérrimo, el contenido es nefasto y lamentable para mi aprendizaje.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que Ana Gabriela es paupérrima enseñando, su método es nefasto y mi aprendizaje ha sido lamentable.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La estructura del curso es deplorable y funesta, siento que no he obtenido nada positivo y ha sido nocivo.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La forma en que Ana Gabriela lleva el curso es deplorable, siento que es funesto y no he aprendido nada positivo.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El desarrollo del curso ha sido perjudicial y dañino, la experiencia ha sido tóxica y repugnante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Ana Gabriela explica Desarrollo Web de manera excelente, su claridad hace que aprenda mucho. Es genial y fantástico tenerla como docente.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El curso de Desarrollo Web es excelente y bueno, aprendí conceptos claros y útiles. Es genial y fantástico.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Ana Gabriela es una profesora maravillosa, su guía es útil y siempre tiene una actitud positiva y agradable en clase de Desarrollo Web.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que el curso es maravilloso y útil, tiene un enfoque positivo y agradable para el aprendizaje.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Me siento satisfecho con Ana Gabriela, su enseñanza es perfecta y estoy feliz y contento con su dedicación al curso.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Estoy satisfecho con el curso de Desarrollo Web, es perfecto y me siento feliz y contento con el contenido.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Ana Gabriela es increíblemente eficiente, su apoyo es asombroso y siempre tiene una actitud brillante en Desarrollo Web.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El curso es increíblemente eficiente y asombroso, la organización es brillante y es una maravilla.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Es una maravilla la forma en que Ana Gabriela enseña, es espectacular y siempre hace la clase emocionante y grandiosa.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La dinámica del curso es espectacular y emocionante, el aprendizaje es grandioso e inspirador.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Ana Gabriela es una profesora inspiradora, su motivación es constructiva y su retroalimentación siempre es enriquecedora y oportuna.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que el curso es motivador y constructivo, la experiencia es enriquecedora y oportuna para mi formación.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que Ana Gabriela es acertada en su enseñanza, valiosa para nuestro aprendizaje y provechosa en cada clase de Desarrollo Web.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El contenido del curso es acertado y valioso, el aprendizaje es provechoso e interesante para mi carrera.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Ana Gabriela hace la clase interesante y dinámica, siempre participativa y con un curso bien estructurado.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La metodología del curso es dinámica y participativa, el curso está organizado y bien estructurado.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La profesora Ana Gabriela es normal, su desempeño es neutral y regular durante las clases de Desarrollo Web.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso de Desarrollo Web es normal y neutral, el contenido es regular y promedio para la materia.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que Ana Gabriela tiene un estilo de enseñanza promedio, es aceptable y suficiente para el desarrollo del curso.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el curso es suave y aceptable, el nivel es suficiente y se mantiene en un estándar común.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Mi experiencia con la profesora Ana Gabriela ha sido suave, su trato es estándar y la comunicación es común.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Mi experiencia con el curso de Desarrollo Web ha sido ordinaria y pasable, dentro de lo moderado y tolerable.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La forma en que Ana Gabriela lleva el curso de Desarrollo Web es ordinaria, dentro de lo pasable y moderado.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso presenta un contenido simple y sencillo, algo habitual y corriente dentro de la ingeniería.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Diría que la actitud de Ana Gabriela es tolerable, su nivel de compromiso es suficiente y se mantiene en un estándar.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La estructura del curso es típica y característica, el desarrollo es usual y frecuente.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La explicación de Ana Gabriela en Desarrollo Web es simple, sin destacar pero tampoco siendo negativa, algo habitual.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el nivel del curso es general y medio, sin elementos particularmente positivos o negativos.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que la retroalimentación de Ana Gabriela es corriente, cumple con lo típico y se mantiene en un nivel promedio.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El enfoque del curso es intermedio y equilibrado, manteniendo un balance y resultando objetivo.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La gestión del curso por parte de Ana Gabriela es equilibrada, se mantiene en un punto medio y resulta aceptable para la mayoría.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La organización del curso es balanceada y moderada, resultando aceptable y dentro de lo estándar.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La profesora Ana Gabriela es mala explicando, su clase es confusa y mi aprendizaje ha sido pésimo en Desarrollo Web.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El curso de Desarrollo Web es malo y confuso, mi aprendizaje ha sido pésimo y no he aprendido nada.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que la dedicación de Ana Gabriela es nada positiva, su actitud es horrible y mi experiencia ha sido terrible.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que el curso es horrible y terrible, la experiencia es desagradable e inútil para mi formación.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que la enseñanza de Ana Gabriela es desagradable e inútil, su retroalimentación es negativa y frustrante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, el curso es negativo y frustrante, mi experiencia ha sido decepcionante y lenta.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, Ana Gabriela es decepcionante como profesora, su ritmo es lento e ineficiente en Desarrollo Web.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El curso de Desarrollo Web es ineficiente y aburrido, además de difícil y problemático.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La clase de Ana Gabriela es aburrida y difícil, siento que el curso es problemático y desastroso.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que el curso es desastroso y horrendo, mi experiencia ha sido insatisfactoria e irritante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Mi experiencia con Ana Gabriela ha sido horrenda e insatisfactoria, su actitud es irritante y molesta en clase.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el curso es molesto y paupérrimo, el contenido es nefasto y lamentable para mi aprendizaje.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que Ana Gabriela es paupérrima enseñando, su método es nefasto y mi aprendizaje ha sido lamentable.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La estructura del curso es deplorable y funesta, siento que no he obtenido nada positivo y ha sido nocivo.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La forma en que Ana Gabriela lleva el curso es deplorable, siento que es funesto y no he aprendido nada positivo.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El desarrollo del curso ha sido perjudicial y dañino, la experiencia ha sido tóxica y repugnante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Diego Prado explica Complejidad Algorítmica de manera excelente, su claridad hace que aprenda mucho. Es genial y fantástico tenerlo como docente.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El curso de Complejidad Algorítmica es excelente y bueno, aprendí conceptos claros y útiles. Es genial y fantástico.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Diego Prado es un profesor maravilloso, su guía es útil y siempre tiene una actitud positiva y agradable en clase de Complejidad Algorítmica.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que el curso es maravilloso y útil, tiene un enfoque positivo y agradable para el aprendizaje.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Me siento satisfecho con Diego Prado, su enseñanza es perfecta y estoy feliz y contento con su dedicación al curso.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Estoy satisfecho con el curso de Complejidad Algorítmica, es perfecto y me siento feliz y contento con el contenido.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Diego Prado es increíblemente eficiente, su apoyo es asombroso y siempre tiene una actitud brillante en Complejidad Algorítmica.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El curso es increíblemente eficiente y asombroso, la organización es brillante y es una maravilla.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Es una maravilla la forma en que Diego Prado enseña, es espectacular y siempre hace la clase emocionante y grandiosa.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La dinámica del curso es espectacular y emocionante, el aprendizaje es grandioso e inspirador.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Diego Prado es un profesor inspirador, su motivación es constructiva y su retroalimentación siempre es enriquecedora y oportuna.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que el curso es motivador y constructivo, la experiencia es enriquecedora y oportuna para mi formación.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que Diego Prado es acertado en su enseñanza, valioso para nuestro aprendizaje y provechoso en cada clase de Complejidad Algorítmica.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El contenido del curso es acertado y valioso, el aprendizaje es provechoso e interesante para mi carrera.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Diego Prado hace la clase interesante y dinámica, siempre participativa y con un curso bien estructurado.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La metodología del curso es dinámica y participativa, el curso está organizado y bien estructurado.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El profesor Diego Prado es normal, su desempeño es neutral y regular durante las clases de Complejidad Algorítmica.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso de Complejidad Algorítmica es normal y neutral, el contenido es regular y promedio para la materia.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que Diego Prado tiene un estilo de enseñanza promedio, es aceptable y suficiente para el desarrollo del curso.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el curso es suave y aceptable, el nivel es suficiente y se mantiene en un estándar común.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Mi experiencia con el profesor Diego Prado ha sido suave, su trato es estándar y la comunicación es común.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Mi experiencia con el curso de Complejidad Algorítmica ha sido ordinaria y pasable, dentro de lo moderado y tolerable.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La forma en que Diego Prado lleva el curso de Complejidad Algorítmica es ordinaria, dentro de lo pasable y moderado.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso presenta un contenido simple y sencillo, algo habitual y corriente dentro de la ingeniería.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Diría que la actitud de Diego Prado es tolerable, su nivel de compromiso es suficiente y se mantiene en un estándar.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La estructura del curso es típica y característica, el desarrollo es usual y frecuente.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La explicación de Diego Prado en Complejidad Algorítmica es simple, sin destacar pero tampoco siendo negativa, algo habitual.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el nivel del curso es general y medio, sin elementos particularmente positivos o negativos.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que la retroalimentación de Diego Prado es corriente, cumple con lo típico y se mantiene en un nivel promedio.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El enfoque del curso es intermedio y equilibrado, manteniendo un balance y resultando objetivo.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La gestión del curso por parte de Diego Prado es equilibrada, se mantiene en un punto medio y resulta aceptable para la mayoría.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La organización del curso es balanceada y moderada, resultando aceptable y dentro de lo estándar.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El profesor Diego Prado es malo explicando, su clase es confusa y mi aprendizaje ha sido pésimo en Complejidad Algorítmica.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El curso de Complejidad Algorítmica es malo y confuso, mi aprendizaje ha sido pésimo y no he aprendido nada.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que la dedicación de Diego Prado es nada positiva, su actitud es horrible y mi experiencia ha sido terrible.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que el curso es horrible y terrible, la experiencia es desagradable e inútil para mi formación.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que la enseñanza de Diego Prado es desagradable e inútil, su retroalimentación es negativa y frustrante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, el curso es negativo y frustrante, mi experiencia ha sido decepcionante y lenta.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, Diego Prado es decepcionante como profesor, su ritmo es lento e ineficiente en Complejidad Algorítmica.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El curso de Complejidad Algorítmica es ineficiente y aburrido, además de difícil y problemático.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La clase de Diego Prado es aburrida y difícil, siento que el curso es problemático y desastroso.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que el curso es desastroso y horrendo, mi experiencia ha sido insatisfactoria e irritante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Mi experiencia con Diego Prado ha sido horrenda e insatisfactoria, su actitud es irritante y molesta en clase.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el curso es molesto y paupérrimo, el contenido es nefasto y lamentable para mi aprendizaje.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que Diego Prado es paupérrimo enseñando, su método es nefasto y mi aprendizaje ha sido lamentable.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La estructura del curso es deplorable y funesta, siento que no he obtenido nada positivo y ha sido nocivo.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La forma en que Diego Prado lleva el curso es deplorable, siento que es funesto y no he aprendido nada positivo.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El desarrollo del curso ha sido perjudicial y dañino, la experiencia ha sido tóxica y repugnante", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Diego Prado explica Base de Datos II de manera excelente, su claridad hace que aprenda mucho. Es genial y fantástico tenerlo como docente.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El curso de Base de Datos II es excelente y bueno, aprendí conceptos claros y útiles. Es genial y fantástico.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Diego Prado es un profesor maravilloso, su guía es útil y siempre tiene una actitud positiva y agradable en clase de Base de Datos II.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que el curso es maravilloso y útil, tiene un enfoque positivo y agradable para el aprendizaje.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Me siento satisfecho con Diego Prado, su enseñanza es perfecta y estoy feliz y contento con su dedicación al curso.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Estoy satisfecho con el curso de Base de Datos II, es perfecto y me siento feliz y contento con el contenido.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Diego Prado es increíblemente eficiente, su apoyo es asombroso y siempre tiene una actitud brillante en Base de Datos II.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El curso es increíblemente eficiente y asombroso, la organización es brillante y es una maravilla.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Es una maravilla la forma en que Diego Prado enseña, es espectacular y siempre hace la clase emocionante y grandiosa.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La dinámica del curso es espectacular y emocionante, el aprendizaje es grandioso e inspirador.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Diego Prado es un profesor inspirador, su motivación es constructiva y su retroalimentación siempre es enriquecedora y oportuna.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que el curso es motivador y constructivo, la experiencia es enriquecedora y oportuna para mi formación.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que Diego Prado es acertado en su enseñanza, valioso para nuestro aprendizaje y provechoso en cada clase de Base de Datos II.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El contenido del curso es acertado y valioso, el aprendizaje es provechoso e interesante para mi carrera.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Diego Prado hace la clase interesante y dinámica, siempre participativa y con un curso bien estructurado.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La metodología del curso es dinámica y participativa, el curso está organizado y bien estructurado.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El profesor Diego Prado es normal, su desempeño es neutral y regular durante las clases de Base de Datos II.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso de Base de Datos II es normal y neutral, el contenido es regular y promedio para la materia.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que Diego Prado tiene un estilo de enseñanza promedio, es aceptable y suficiente para el desarrollo del curso.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el curso es suave y aceptable, el nivel es suficiente y se mantiene en un estándar común.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Mi experiencia con el profesor Diego Prado ha sido suave, su trato es estándar y la comunicación es común.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Mi experiencia con el curso de Base de Datos II ha sido ordinaria y pasable, dentro de lo moderado y tolerable.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La forma en que Diego Prado lleva el curso de Base de Datos II es ordinaria, dentro de lo pasable y moderado.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso presenta un contenido simple y sencillo, algo habitual y corriente dentro de la ingeniería.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Diría que la actitud de Diego Prado es tolerable, su nivel de compromiso es suficiente y se mantiene en un estándar.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La estructura del curso es típica y característica, el desarrollo es usual y frecuente.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La explicación de Diego Prado en Base de Datos II es simple, sin destacar pero tampoco siendo negativa, algo habitual.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el nivel del curso es general y medio, sin elementos particularmente positivos o negativos.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que la retroalimentación de Diego Prado es corriente, cumple con lo típico y se mantiene en un nivel promedio.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El enfoque del curso es intermedio y equilibrado, manteniendo un balance y resultando objetivo.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La gestión del curso por parte de Diego Prado es equilibrada, se mantiene en un punto medio y resulta aceptable para la mayoría.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La organización del curso es balanceada y moderada, resultando aceptable y dentro de lo estándar.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El profesor Diego Prado es malo explicando, su clase es confusa y mi aprendizaje ha sido pésimo en Base de Datos II.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El curso de Base de Datos II es malo y confuso, mi aprendizaje ha sido pésimo y no he aprendido nada.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que la dedicación de Diego Prado es nada positiva, su actitud es horrible y mi experiencia ha sido terrible.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que el curso es horrible y terrible, la experiencia es desagradable e inútil para mi formación.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que la enseñanza de Diego Prado es desagradable e inútil, su retroalimentación es negativa y frustrante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, el curso es negativo y frustrante, mi experiencia ha sido decepcionante y lenta.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, Diego Prado es decepcionante como profesor, su ritmo es lento e ineficiente en Base de Datos II.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El curso de Base de Datos II es ineficiente y aburrido, además de difícil y problemático.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La clase de Diego Prado es aburrida y difícil, siento que el curso es problemático y desastroso.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que el curso es desastroso y horrendo, mi experiencia ha sido insatisfactoria e irritante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Mi experiencia con Diego Prado ha sido horrenda e insatisfactoria, su actitud es irritante y molesta en clase.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el curso es molesto y paupérrimo, el contenido es nefasto y lamentable para mi aprendizaje.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que Diego Prado es paupérrimo enseñando, su método es nefasto y mi aprendizaje ha sido lamentable.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La estructura del curso es deplorable y funesta, siento que no he obtenido nada positivo y ha sido nocivo.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La forma en que Diego Prado lleva el curso es deplorable, siento que es funesto y no he aprendido nada positivo.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El desarrollo del curso ha sido perjudicial y dañino, la experiencia ha sido tóxica y repugnante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Diana Patricia hace que aprender Inglés III sea excelente, su método claro facilita el aprendizaje. Es genial y fantástico tenerla.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El curso de Inglés III es excelente y bueno, aprendí conceptos claros y útiles. Es genial y fantástico.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La guía de Diana Patricia en Inglés III es maravillosa y útil, su actitud positiva y agradable hace la clase satisfactoria.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que el curso es maravilloso y útil, tiene un enfoque positivo y agradable para el aprendizaje.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Estoy perfecto con la enseñanza de Diana Patricia en Inglés III, me siento feliz y contento con lo aprendido, es increíble.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Estoy satisfecho con el curso de Inglés III, es perfecto y me siento feliz y contento con el contenido.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Diana Patricia es eficiente y asombrosa explicando Inglés III, su apoyo es brillante y hace el curso una maravilla.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El curso es increíblemente eficiente y asombroso, la organización es brillante y es una maravilla.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La clase de Inglés III con Diana Patricia es espectacular y emocionante, el aprendizaje es grandioso e inspirador.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La dinámica del curso es espectacular y emocionante, el aprendizaje es grandioso e inspirador.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Diana Patricia es una profesora motivadora y constructiva en Inglés III, su retroalimentación es enriquecedora y oportuna.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero que el curso es motivador y constructivo, la experiencia es enriquecedora y oportuna para mi formación.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Considero valiosa y provechosa la enseñanza de Inglés III por Diana Patricia, su enfoque es acertado e interesante.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "El contenido del curso es acertado y valioso, el aprendizaje es provechoso e interesante para mi carrera.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La dedicación de Diana Patricia hace la clase de Inglés III dinámica y participativa, el curso está bien organizado.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "La metodología del curso es dinámica y participativa, el curso está organizado y bien estructurado.", "cats": {"positivo": 1, "neutral": 0, "negativo": 0}}
{"text": "Diana Patricia enseña Inglés III de forma normal y neutral, su desempeño es regular y promedio para el curso.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso de Inglés III es normal y neutral, el contenido es regular y promedio para la materia.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero su estilo de enseñanza en Inglés III suave y aceptable, suficiente y dentro de un estándar común.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el curso es suave y aceptable, el nivel es suficiente y se mantiene en un estándar común.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Mi experiencia con Diana Patricia en Inglés III ha sido ordinaria y pasable, su trato es moderado y tolerable.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Mi experiencia con el curso de Inglés III ha sido ordinaria y pasable, dentro de lo moderado y tolerable.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La manera en que Diana Patricia lleva Inglés III es simple y sencilla, algo habitual y corriente en la enseñanza.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El curso presenta un contenido simple y sencillo, algo habitual y corriente dentro del aprendizaje de idiomas.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Diría que la actitud de Diana Patricia en Inglés III es típica y característica, su nivel es usual y frecuente.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La estructura del curso es típica y característica, el desarrollo es usual y frecuente.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero su explicación en Inglés III general y media, sin elementos particularmente positivos o negativos.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Considero que el nivel del curso es general y medio, sin elementos particularmente positivos o negativos.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La retroalimentación de Diana Patricia en Inglés III es intermedio y equilibrado, manteniendo un balance objetivo.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "El enfoque del curso es intermedio y equilibrado, manteniendo un balance y resultando objetivo.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La gestión de Diana Patricia en Inglés III es balanceada y moderada, resultando aceptable y dentro de lo estándar.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "La organización del curso es balanceada y moderada, resultando aceptable y dentro de lo estándar.", "cats": {"positivo": 0, "neutral": 1, "negativo": 0}}
{"text": "Diana Patricia explica Inglés III de forma mala y confusa, mi aprendizaje ha sido pésimo y no aprendí nada.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El curso de Inglés III es malo y confuso, mi aprendizaje ha sido pésimo y no he aprendido nada.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero su dedicación en Inglés III horrible y terrible, su actitud es desagradable e inútil para mí.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que el curso es horrible y terrible, la experiencia es desagradable e inútil para mi formación.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, la enseñanza de Diana Patricia en Inglés III es negativa y frustrante, mi experiencia fue decepcionante y lenta.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Lamentablemente, el curso es negativo y frustrante, mi experiencia ha sido decepcionante y lenta.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La forma en que Diana Patricia lleva Inglés III es ineficiente y aburrida, además de difícil y problemática.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El curso de Inglés III es ineficiente y aburrido, además de difícil y problemático.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que la clase de Inglés III con Diana Patricia es desastrosa y horrenda, mi experiencia fue insatisfactoria e irritante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Siento que el curso es desastroso y horrendo, mi experiencia ha sido insatisfactoria e irritante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero a Diana Patricia molesta y paupérrima enseñando Inglés III, su método es nefasto y lamentable.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "Considero que el curso es molesto y paupérrimo, el contenido es nefasto y lamentable para mi aprendizaje.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La estructura de la clase de Inglés III con Diana Patricia es deplorable y funesta, no obtuve nada positivo y fue nocivo.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "La estructura del curso es deplorable y funesta, siento que no he obtenido nada positivo y ha sido nocivo.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El desarrollo de Inglés III por Diana Patricia fue perjudicial y dañino, la experiencia fue tóxica y repugnante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
{"text": "El desarrollo del curso ha sido perjudicial y dañino, la experiencia ha sido tóxica y repugnante.", "cats": {"positivo": 0, "neutral": 0, "negativo": 1}}
